app/Http/Controllers/V1/BananaController.php

select `banana_img`, `banana_href` from `bananas` where (`banana_status` = 1) and `bananas`.`deleted_at` is null order by `banana_time` desc limit 10
---
    public function get()
    {
        $banana = Cache::remember('bananas', cacheTime(20), function () {
            return Bananas::select(['banana_img', 'banana_href'])
                ->where(['banana_status' => 1])
                ->orderBy('banana_time', 'desc')
                ->limit(10)
                ->get();