app/Http/Controllers/V1/GoodController.php

    public function getHomeList()
    {
        $goods = Cache::remember('homeList', cacheTime(), function () {
            return $goods = Goods::select(['good_id', 'good_image', 'good_title', 'good_info', 'good_price', 'good_market_price'])
                ->where(['good_place' => 1, 'good_status' => 1])
                ->orderBy('good_time', 'desc')
                ->limit(10)
                ->get();
---
select `good_id`, `good_image`, `good_title`, `good_info`, `good_price`, `good_market_price` from `goods` where (`good_place` = 1 and `good_status` = 1) and `goods`.`deleted_at` is null order by `good_time` desc limit 10

    public function page(Request $request)
    {
        $limit = $request->input('limit', 15);
        //Cache::delete('goodPage' . $limit);
        $good = Cache::remember('goodPage' . $limit, cacheTime(30), function () use ($limit) {
            return Goods::where(['good_status' => 1])
                ->select(['good_id','good_people', 'good_image', 'good_title', 'good_info', 'good_price', 'good_market_price'])
                ->orderBy('good_time', 'desc')
                ->simplePaginate($limit);
---
select `good_id`, `good_people`, `good_image`, `good_title`, `good_info`, `good_price`, `good_market_price` from `goods` where (`good_status` = 1) and `goods`.`deleted_at` is null order by `good_time` desc limit 16 offset 0