app/Models/Groups.php

select `user_img`, `group_id`, `group_end_time`, `group_number` from `groups` inner join `users` on `users`.`user_id` = `groups`.`group_user_id` where (`group_good_id` = '17' and `group_status` = 0 and `group_pay` = 1) and `group_number` > 0 and `groups`.`deleted_at` is null order by `group_number` asc limit 5
---
    public static function getGroupByGoodId($id)
    {
        return static::where(['group_good_id' => $id, 'group_status' => 0, 'group_pay' => 1])
            ->where('group_number', '>', 0)
            ->limit(5)
            ->orderBy('group_number', 'asc')
            ->join('users', 'users.user_id', '=', 'groups.group_user_id')
            ->select(['user_img', 'group_id', 'group_end_time', 'group_number'])
            ->get();