app/Models/UserAddress.php

    public static function updateDefault($userid, $id)
    {
        $default = static::where(['address_user_id' => $userid, 'address_id' => $id])
            ->select(['address_status'])
            ->first();
        if (is_null($default)) {
            return false;
        }
        if ($default->address_status == 1) {
            return true;
        }
        DB::transaction(function () use ($userid, $id) {
            static::where(['address_user_id' => $userid])->update(['address_status' => 0]);
            static::where(['address_user_id' => $userid, 'address_id' => $id])->update(['address_status' => 1]);
---
select `address_status` from `user_address` where (`address_user_id` = 1 and `address_id` = '7') and `user_address`.`deleted_at` is null limit 1
update `user_address` set `address_status` = 0 where (`address_user_id` = 1) and `user_address`.`deleted_at` is null
update `user_address` set `address_status` = 1 where (`address_user_id` = 1 and `address_id` = '7') and `user_address`.`deleted_at` is null